In [1]:
import os
os.environ["JAVA_HOME"] = "C:/Program Files/Java/jdk-19"
os.environ["SPARK_HOME"] = "C:/spark/spark-3.3.2-bin-hadoop3"

In [2]:
import pyspark 
from pyspark.sql import SparkSession
jdbc_driver_path= "C:/Users/Sharing Vision/anaconda3/libs/postgresql-42.7.3.jar"
spark = SparkSession.builder.appName("PySpark")\
        .config("spark.jars.packages", "org.postgresql:postgresql:42.7.3")\
        .config('spark.dynamicAllocation.enabled', 'false')\
        .config('spark.executor.instances', '8')\
        .config('spark.executor.cores', '6')\
        .config('spark.executor.memory', '12g')\
        .getOrCreate()
spark

In [3]:

#ingest table categories

ingest=spark.read.format("jdbc")\
      .option("driver","org.postgresql.Driver")
 
dst_db_ip="localhost"
dst_db_port="5432"
dst_db_name="northwind"
user="postgres"
password="12345678"
dst_schm_name="public"
dst_tbl_name="categories"

jdbc_url = f"jdbc:postgresql://{dst_db_ip}:{dst_db_port}/{dst_db_name}?user={user}&password={password}" 

df_categories = spark.read.format("jdbc") \
      .option("driver", "org.postgresql.Driver") \
      .option("url", jdbc_url) \
      .option("dbtable", f"(select * from {dst_schm_name}.{dst_tbl_name}) as tmp") \
      .load()

df_categories.createOrReplaceTempView("df_categories")
df_categories.show()


# df=ingest\
#   .option("url","jdbc:postgresql://{}:{}/{}?user={}&password={}".format(dst_db_ip,dst_db_port,dst_db_name,user,password))\
#   .option("dbtable","(select * from {}.{} ) as tmp".format(dst_schm_name,dst_tbl_name))\
#   .load()

+----------+--------------+--------------------+--------------------+
|CATEGORYID|  CATEGORYNAME|         DESCRIPTION|             PICTURE|
+----------+--------------+--------------------+--------------------+
|         1|     Beverages|Soft drinks coffe...|0x151C2F000200000...|
|         2|    Condiments|Sweet and savory ...|0x151C2F000200000...|
|         3|   Confections|Desserts candies ...|0x151C2F000200000...|
|         4|Dairy Products|             Cheeses|0x151C2F000200000...|
|         5|Grains/Cereals|Breads crackers p...|0x151C2F000200000...|
|         6|  Meat/Poultry|      Prepared meats|0x151C2F000200000...|
|         7|       Produce|Dried fruit and b...|0x151C2F000200000...|
|         8|       Seafood|    Seaweed and fish|0x151C2F000200000...|
+----------+--------------+--------------------+--------------------+

In [4]:
#Ingest order_details

dst_tbl_name="order_details"
df_order_details = spark.read.format("jdbc") \
      .option("driver", "org.postgresql.Driver") \
      .option("url", jdbc_url) \
      .option("dbtable", f"(select * from {dst_schm_name}.{dst_tbl_name}) as tmp") \
      .load()
df_order_details.createOrReplaceTempView("df_order_details")     
df_order_details.show()

+-------+---------+---------+--------+--------+
|ORDERID|PRODUCTID|UNITPRICE|QUANTITY|DISCOUNT|
+-------+---------+---------+--------+--------+
|  10248|       11|     14.0|      12|     0.0|
|  10248|       42|      9.8|      10|     0.0|
|  10248|       72|     34.8|       5|     0.0|
|  10249|       14|     18.6|       9|     0.0|
|  10249|       51|     42.4|      40|     0.0|
|  10250|       41|      7.7|      10|     0.0|
|  10250|       51|     42.4|      35|    0.15|
|  10250|       65|     16.8|      15|    0.15|
|  10251|       22|     16.8|       6|    0.05|
|  10251|       57|     15.6|      15|    0.05|
|  10251|       65|     16.8|      20|     0.0|
|  10252|       20|     64.8|      40|    0.05|
|  10252|       33|      2.0|      25|    0.05|
|  10252|       60|     27.2|      40|     0.0|
|  10253|       31|     10.0|      20|     0.0|
|  10253|       39|     14.4|      42|     0.0|
|  10253|       49|     16.0|      40|     0.0|
|  10254|       24|      3.6|      15|    0.15|
|  10254|       55|     19.2|      21|    0.15|
|  10254|       74|      8.0|      21|     0.0|
+-------+---------+---------+--------+--------+
only showing top 20 rows

In [5]:
#Ingest products

dst_tbl_name="products"
df_products = spark.read.format("jdbc") \
      .option("driver", "org.postgresql.Driver") \
      .option("url", jdbc_url) \
      .option("dbtable", f"(select * from {dst_schm_name}.{dst_tbl_name}) as tmp") \
      .load()
df_products.createOrReplaceTempView("df_products")      
df_products.show()

+---------+--------------------+----------+----------+--------------------+---------+------------+------------+------------+------------+
|PRODUCTID|         PRODUCTNAME|SUPPLIERID|CATEGORYID|     QUANTITYPERUNIT|UNITPRICE|UNITSINSTOCK|UNITSONORDER|REORDERLEVEL|DISCONTINUED|
+---------+--------------------+----------+----------+--------------------+---------+------------+------------+------------+------------+
|        1|                Chai|         1|         1|  10 boxes x 20 bags|     18.0|          39|           0|          10|           0|
|        2|               Chang|         1|         1|  24 - 12 oz bottles|     19.0|          17|          40|          25|           0|
|        3|       Aniseed Syrup|         1|         2| 12 - 550 ml bottles|     10.0|          13|          70|          25|           0|
|        4|Chef Anton's Caju...|         2|         2|      48 - 6 oz jars|     22.0|          53|           0|           0|           0|
|        5|Chef Anton's Gumb...|         2|         2|            36 boxes|    21.35|           0|           0|           0|           1|
|        6|Grandma's Boysenb...|         3|         2|      12 - 8 oz jars|     25.0|         120|           0|          25|           0|
|        7|Uncle Bob's Organ...|         3|         7|     12 - 1 lb pkgs.|     30.0|          15|           0|          10|           0|
|        8|Northwoods Cranbe...|         3|         2|     12 - 12 oz jars|     40.0|           6|           0|           0|           0|
|        9|     Mishi Kobe Niku|         4|         6|    18 - 500 g pkgs.|     97.0|          29|           0|           0|           1|
|       10|               Ikura|         4|         8|    12 - 200 ml jars|     31.0|          31|           0|           0|           0|
|       11|      Queso Cabrales|         5|         4|           1 kg pkg.|     21.0|          22|          30|          30|           0|
|       12|Queso Manchego La...|         5|         4|    10 - 500 g pkgs.|     38.0|          86|           0|           0|           0|
|       13|               Konbu|         6|         8|            2 kg box|      6.0|          24|           0|           5|           0|
|       14|                Tofu|         6|         7|    40 - 100 g pkgs.|    23.25|          35|           0|           0|           0|
|       15|        Genen Shouyu|         6|         2| 24 - 250 ml bottles|     15.5|          39|           0|           5|           0|
|       16|             Pavlova|         7|         3|    32 - 500 g boxes|    17.45|          29|           0|          10|           0|
|       17|        Alice Mutton|         7|         6|      20 - 1 kg tins|     39.0|           0|           0|           0|           1|
|       18|    Carnarvon Tigers|         7|         8|          16 kg pkg.|     62.5|          42|           0|           0|           0|
|       19|Teatime Chocolate...|         8|         3|10 boxes x 12 pieces|      9.2|          25|           0|           5|           0|
|       20|Sir Rodney's Marm...|         8|         3|       30 gift boxes|     81.0|          40|           0|           0|           0|
+---------+--------------------+----------+----------+--------------------+---------+------------+------------+------------+------------+
only showing top 20 rows

In [6]:
#Ingest orders

dst_tbl_name="orders"
df_orders = spark.read.format("jdbc") \
      .option("driver", "org.postgresql.Driver") \
      .option("url", jdbc_url) \
      .option("dbtable", f"(select * from {dst_schm_name}.{dst_tbl_name}) as tmp") \
      .load()
df_orders.createOrReplaceTempView("df_orders")
df_orders.show()

+-------+----------+----------+----------+------------+-----------+-------+-------+--------------------+--------------------+--------------+----------+--------------+-----------+
|ORDERID|CUSTOMERID|EMPLOYEEID| ORDERDATE|REQUIREDDATE|SHIPPEDDATE|SHIPVIA|FREIGHT|            SHIPNAME|         SHIPADDRESS|      SHIPCITY|SHIPREGION|SHIPPOSTALCODE|SHIPCOUNTRY|
+-------+----------+----------+----------+------------+-----------+-------+-------+--------------------+--------------------+--------------+----------+--------------+-----------+
|  10248|     VINET|         5|1996-07-04|  1996-08-01| 1996-07-16|      3|  32.38|Vins et alcools C...|  59 rue de l'Abbaye|         Reims|      null|         51100|     France|
|  10249|     TOMSP|         6|1996-07-05|  1996-08-16| 1996-07-10|      1|  11.61|  Toms Spezialitäten|       Luisenstr. 48|       Münster|      null|         44087|    Germany|
|  10250|     HANAR|         4|1996-07-08|  1996-08-05| 1996-07-12|      2|  65.83|       Hanari Carnes|      Rua do Paço 67|Rio de Janeiro|        RJ|     05454-876|     Brazil|
|  10251|     VICTE|         3|1996-07-08|  1996-08-05| 1996-07-15|      1|  41.34|Victuailles en stock|   2 rue du Commerce|          Lyon|      null|         69004|     France|
|  10252|     SUPRD|         4|1996-07-09|  1996-08-06| 1996-07-11|      2|   51.3|    Suprêmes délices| Boulevard Tirou 255|     Charleroi|      null|        B-6000|    Belgium|
|  10253|     HANAR|         3|1996-07-10|  1996-07-24| 1996-07-16|      2|  58.17|       Hanari Carnes|      Rua do Paço 67|Rio de Janeiro|        RJ|     05454-876|     Brazil|
|  10254|     CHOPS|         5|1996-07-11|  1996-08-08| 1996-07-23|      2|  22.98|   Chop-suey Chinese|        Hauptstr. 31|          Bern|      null|          3012|Switzerland|
|  10255|     RICSU|         9|1996-07-12|  1996-08-09| 1996-07-15|      3| 148.33|  Richter Supermarkt|         Starenweg 5|        Genève|      null|          1204|Switzerland|
|  10256|     WELLI|         3|1996-07-15|  1996-08-12| 1996-07-17|      2|  13.97|Wellington Import...|   Rua do Mercado 12|       Resende|        SP|     08737-363|     Brazil|
|  10257|     HILAA|         4|1996-07-16|  1996-08-13| 1996-07-22|      3|  81.91|    HILARION-Abastos|Carrera 22 con Av...| San Cristóbal|   Táchira|          5022|  Venezuela|
|  10258|     ERNSH|         1|1996-07-17|  1996-08-14| 1996-07-23|      1| 140.51|        Ernst Handel|        Kirchgasse 6|          Graz|      null|          8010|    Austria|
|  10259|     CENTC|         4|1996-07-18|  1996-08-15| 1996-07-25|      3|   3.25|Centro comercial ...|Sierras de Granad...|   México D.F.|      null|         05022|     Mexico|
|  10260|     OTTIK|         4|1996-07-19|  1996-08-16| 1996-07-29|      1|  55.09|  Ottilies Käseladen|  Mehrheimerstr. 369|          Köln|      null|         50739|    Germany|
|  10261|     QUEDE|         4|1996-07-19|  1996-08-16| 1996-07-30|      2|   3.05|         Que Delícia|Rua da Panificado...|Rio de Janeiro|        RJ|     02389-673|     Brazil|
|  10262|     RATTC|         8|1996-07-22|  1996-08-19| 1996-07-25|      3|  48.29|Rattlesnake Canyo...|     2817 Milton Dr.|   Albuquerque|        NM|         87110|        USA|
|  10263|     ERNSH|         9|1996-07-23|  1996-08-20| 1996-07-31|      3| 146.06|        Ernst Handel|        Kirchgasse 6|          Graz|      null|          8010|    Austria|
|  10264|     FOLKO|         6|1996-07-24|  1996-08-21| 1996-08-23|      3|   3.67|      Folk och fä HB|        Åkergatan 24|        Bräcke|      null|      S-844 67|     Sweden|
|  10265|     BLONP|         2|1996-07-25|  1996-08-22| 1996-08-12|      1|  55.28|Blondel père et fils|     24 place Kléber|    Strasbourg|      null|         67000|     France|
|  10266|     WARTH|         3|1996-07-26|  1996-09-06| 1996-07-31|      3|  25.73|      Wartian Herkku|         Torikatu 38|          Oulu|      null|         90110|    Finland|
|  10267|     FRANK|         4|1996-07-29|  1996-08-26| 1996-08-06|      1| 208.58|      Frankenversand|   Berliner Platz 43|       München|      null|         80805|    Germany|
+-------+----------+----------+----------+------------+-----------+-------+-------+--------------------+--------------------+--------------+----------+--------------+-----------+
only showing top 20 rows

In [7]:
#Ingest suppliers

dst_tbl_name="suppliers"
df_suppliers = spark.read.format("jdbc") \
      .option("driver", "org.postgresql.Driver") \
      .option("url", jdbc_url) \
      .option("dbtable", f"(select * from {dst_schm_name}.{dst_tbl_name}) as tmp") \
      .load()
df_suppliers.createOrReplaceTempView("df_suppliers")
df_suppliers.show()

+----------+--------------------+--------------------+--------------------+--------------------+-----------+--------+----------+---------+---------------+---------------+--------------------+
|SUPPLIERID|         COMPANYNAME|         CONTACTNAME|        CONTACTTITLE|             ADDRESS|       CITY|  REGION|POSTALCODE|  COUNTRY|          PHONE|            FAX|            HOMEPAGE|
+----------+--------------------+--------------------+--------------------+--------------------+-----------+--------+----------+---------+---------------+---------------+--------------------+
|         1|      Exotic Liquids|    Charlotte Cooper|  Purchasing Manager|      49 Gilbert St.|     London|    null|   EC1 4SD|       UK| (171) 555-2222|           null|                null|
|         2|New Orleans Cajun...|       Shelley Burke| Order Administrator|      P.O. Box 78934|New Orleans|      LA|     70117|      USA| (100) 555-4822|           null|         #CAJUN.HTM#|
|         3|Grandma Kelly's H...|       Regina Murphy|Sales Representative|      707 Oxford Rd.|  Ann Arbor|      MI|     48104|      USA| (313) 555-5735| (313) 555-3349|                null|
|         4|       Tokyo Traders|        Yoshi Nagase|   Marketing Manager|9-8 Sekimai Musas...|      Tokyo|    null|       100|    Japan| (03) 3555-5011|           null|                null|
|         5|Cooperativa de Qu...|Antonio del Valle...|Export Administrator|   Calle del Rosal 4|     Oviedo|Asturias|     33007|    Spain| (98) 598 76 54|           null|                null|
|         6|            Mayumi's|         Mayumi Ohno|Marketing Represe...|  92 Setsuko Chuo-ku|      Osaka|    null|       545|    Japan|  (06) 431-7877|           null|Mayumi's (on the ...|
|         7|        Pavlova Ltd.|         Ian Devling|   Marketing Manager|74 Rose St. Mooni...|  Melbourne|Victoria|      3058|Australia|  (03) 444-2343|  (03) 444-6588|                null|
|         8|Specialty Biscuit...|        Peter Wilson|Sales Representative|       29 King's Way| Manchester|    null|   M14 GSD|       UK| (161) 555-4448|           null|                null|
|         9|    PB Knäckebröd AB|       Lars Peterson|         Sales Agent|     Kaloadagatan 13|   Göteborg|    null|  S-345 67|   Sweden|  031-987 65 43|  031-987 65 91|                null|
|        10|Refrescos America...|         Carlos Diaz|   Marketing Manager|Av. das Americana...|  Sao Paulo|    null|      5442|   Brazil|  (11) 555 4640|           null|                null|
|        11|Heli Süßwaren Gmb...|       Petra Winkler|       Sales Manager|  Tiergartenstraße 5|     Berlin|    null|     10785|  Germany|  (010) 9984510|           null|                null|
|        12|Plutzer Lebensmit...|         Martin Bein|International Mar...|       Bogenallee 51|  Frankfurt|    null|     60439|  Germany|   (069) 992755|           null|Plutzer (on the W...|
|        13|Nord-Ost-Fisch Ha...|       Sven Petersen|Coordinator Forei...|    Frahmredder 112a|   Cuxhaven|    null|     27478|  Germany|   (04721) 8713|   (04721) 8714|                null|
|        14|Formaggi Fortini ...|          Elio Rossi|Sales Representative|      Viale Dante 75|    Ravenna|    null|     48100|    Italy|   (0544) 60323|   (0544) 60603|      #FORMAGGI.HTM#|
|        15|     Norske Meierier|        Beate Vileid|   Marketing Manager|        Hatlevegen 5|   Sandvika|    null|      1320|   Norway|    (0)2-953010|           null|                null|
|        16|   Bigfoot Breweries|       Cheryl Saylor|Regional Account ...|3400 - 8th Avenue...|       Bend|      OR|     97101|      USA| (503) 555-9931|           null|                null|
|        17|   Svensk Sjöföda AB|       Michael Björn|Sales Representative|   Brovallavägen 231|  Stockholm|    null|  S-123 45|   Sweden|   08-123 45 67|           null|                null|
|        18|Aux joyeux ecclés...|      Guylène Nodier|       Sales Manager|203 Rue des Franc...|      Paris|    null|     75004|   France|(1) 03.83.00.68|(1) 03.83.00.62|                null|
|        19|New England Seafo...|       Robb Merchant|Wholesale Account...|Order Processing ...|     Boston|      MA|      2134|      USA| (617) 555-3267| (617) 555-3389|                null|
|        20|        Leka Trading|        Chandra Leka|               Owner|471 Serangoon Loo...|  Singapore|    null|       512|Singapore|       555-8787|           null|                null|
+----------+--------------------+--------------------+--------------------+--------------------+-----------+--------+----------+---------+---------------+---------------+--------------------+
only showing top 20 rows

In [8]:
#Ingest employees

dst_tbl_name="employees"
df_employees = spark.read.format("jdbc") \
      .option("driver", "org.postgresql.Driver") \
      .option("url", jdbc_url) \
      .option("dbtable", f"(select * from {dst_schm_name}.{dst_tbl_name}) as tmp") \
      .load()
df_employees.createOrReplaceTempView("df_employees")
df_employees.show()

+----------+---------+---------+--------------------+---------------+----------+----------+--------------------+--------+------+----------+-------+--------------+---------+--------------------+--------------------+---------+--------------------+
|EMPLOYEEID| LASTNAME|FIRSTNAME|               TITLE|TITLEOFCOURTESY| BIRTHDATE|  HIREDATE|             ADDRESS|    CITY|REGION|POSTALCODE|COUNTRY|     HOMEPHONE|EXTENSION|               PHOTO|               NOTES|REPORTSTO|           PHOTOPATH|
+----------+---------+---------+--------------------+---------------+----------+----------+--------------------+--------+------+----------+-------+--------------+---------+--------------------+--------------------+---------+--------------------+
|         1|  Davolio|    Nancy|Sales Representative|            Ms.|1948-12-08|1992-05-01|507 20th Ave. E. ...| Seattle|    WA|     98122|    USA|(206) 555-9857|     5467|0x151C2F000200000...|Education include...|      2.0|http://accweb/emm...|
|         2|   Fuller|   Andrew|Vice President Sales|            Dr.|1952-02-19|1992-08-14|  908 W. Capital Way|  Tacoma|    WA|     98401|    USA|(206) 555-9482|     3457|0x151C2F000200000...|Andrew received h...|     null|http://accweb/emm...|
|         3|Leverling|    Janet|Sales Representative|            Ms.|1963-08-30|1992-04-01|  722 Moss Bay Blvd.|Kirkland|    WA|     98033|    USA|(206) 555-3412|     3355|0x151C2F000200000...|Janet has a BS de...|      2.0|http://accweb/emm...|
|         4|  Peacock| Margaret|Sales Representative|           Mrs.|1937-09-19|1993-05-03|4110 Old Redmond Rd.| Redmond|    WA|     98052|    USA|(206) 555-8122|     5176|0x151C2F000200000...|Margaret holds a ...|      2.0|http://accweb/emm...|
|         5| Buchanan|   Steven|       Sales Manager|            Mr.|1955-03-04|1993-10-17|     14 Garrett Hill|  London|  null|   SW1 8JR|     UK| (71) 555-4848|     3453|0x151C2F000200000...|Steven Buchanan g...|      2.0|http://accweb/emm...|
|         6|   Suyama|  Michael|Sales Representative|            Mr.|1963-07-02|1993-10-17|Coventry House Mi...|  London|  null|   EC2 7JR|     UK| (71) 555-7773|      428|0x151C2F000200000...|Michael is a grad...|      5.0|http://accweb/emm...|
|         7|     King|   Robert|Sales Representative|            Mr.|1960-05-29|1994-01-02|Edgeham Hollow Wi...|  London|  null|   RG1 9SP|     UK| (71) 555-5598|      465|0x151C2F000200000...|Robert King serve...|      5.0|http://accweb/emm...|
|         8| Callahan|    Laura|Inside Sales Coor...|            Ms.|1958-01-09|1994-03-05| 4726 11th Ave. N.E.| Seattle|    WA|     98105|    USA|(206) 555-1189|     2344|0x151C2F000200000...|Laura received a ...|      2.0|http://accweb/emm...|
|         9|Dodsworth|     Anne|Sales Representative|            Ms.|1966-01-27|1994-11-15|   7 Houndstooth Rd.|  London|  null|   WG2 7LT|     UK| (71) 555-4444|      452|0x151C2F000200000...|Anne has a BA deg...|      5.0|http://accweb/emm...|
+----------+---------+---------+--------------------+---------------+----------+----------+--------------------+--------+------+----------+-------+--------------+---------+--------------------+--------------------+---------+--------------------+

In [9]:
# Create datamart tables  (employee_revenues)


employee_revenues = spark.sql("""

WITH employee_revenue AS (
  SELECT
    e.FIRSTNAME || ' ' || e.LASTNAME AS employee_name,
    date_format(DATE_TRUNC('month', o.ORDERDATE), 'yyy-MM')  AS month_order,
    SUM((od.UNITPRICE - (od.UNITPRICE * od.DISCOUNT)) * od.QUANTITY) AS gross_revenue
  FROM
    df_order_details od
    JOIN df_orders o ON od.ORDERID = o.ORDERID
    JOIN df_employees e ON o.EMPLOYEEID = e.EMPLOYEEID
  GROUP BY
    employee_name, month_order
),
ranked_employees AS (
  SELECT
    employee_name,
    month_order,
    gross_revenue,
    ROW_NUMBER() OVER (PARTITION BY month_order ORDER BY gross_revenue DESC) AS rank
  FROM
    employee_revenue
)
SELECT
  employee_name,
  month_order,
  gross_revenue
FROM
  ranked_employees
WHERE
  rank = 1

""")

In [10]:
#cek bentuk data

employee_revenues.show()

+----------------+-----------+------------------+
|   employee_name|month_order|     gross_revenue|
+----------------+-----------+------------------+
|Margaret Peacock|    1996-07|          11860.45|
|  Laura Callahan|    1996-08|            8263.8|
|   Nancy Davolio|    1996-09|            6651.0|
|Margaret Peacock|    1996-10|          13718.97|
|Margaret Peacock|    1996-11|11311.419999999998|
| Steven Buchanan|    1996-12|10030.820000000003|
|Margaret Peacock|    1997-01|23736.465000000004|
|Margaret Peacock|    1997-02|         12121.995|
| Janet Leverling|    1997-03|11599.400000000001|
|Margaret Peacock|    1997-04|          13475.99|
| Janet Leverling|    1997-05|           18049.6|
|   Andrew Fuller|    1997-06| 6882.199999999999|
|   Nancy Davolio|    1997-07|          19530.93|
|Margaret Peacock|    1997-08|          16485.54|
|     Robert King|    1997-09|          13249.86|
|   Nancy Davolio|    1997-10|          12414.15|
| Janet Leverling|    1997-11|          9598.084|
| Janet Leverling|    1997-12|         17636.659|
| Janet Leverling|    1998-01|        25705.0075|
|   Andrew Fuller|    1998-02|          23127.55|
+----------------+-----------+------------------+
only showing top 20 rows

In [11]:
#ubah ke bentuk pandas untuk di upload ke BQ
df_datamart_employee_revenues=employee_revenues.toPandas()

C:\Users\Sharing Vision\AppData\Roaming\Python\Python39\site-packages\pandas\core\computation\expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.8.3' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
C:\Users\Sharing Vision\AppData\Roaming\Python\Python39\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [12]:
# Create datamart tables  (category_sales)


category_sales = spark.sql("""

WITH category_sales AS (
  SELECT
    c.CATEGORYNAME AS category_name,
    DATE_FORMAT(DATE_TRUNC('month', o.ORDERDATE), 'yyyy-MM') AS month_order,
    SUM(od.QUANTITY) AS total_sold
  FROM
    df_order_details od
    JOIN df_orders o ON od.ORDERID = o.ORDERID
    JOIN df_products p ON od.PRODUCTID = p.PRODUCTID
    JOIN df_categories c ON p.CATEGORYID = c.CATEGORYID
  GROUP BY
    category_name, month_order
),
ranked_categories AS (
  SELECT
    category_name,
    month_order,
    total_sold,
    ROW_NUMBER() OVER (PARTITION BY month_order ORDER BY total_sold DESC) AS rank
  FROM
    category_sales
)

SELECT
  category_name,
  month_order,
  total_sold
FROM
  ranked_categories
WHERE
  rank = 1

""")

In [13]:
#cek bentuk data

category_sales.show()

+--------------+-----------+----------+
| category_name|month_order|total_sold|
+--------------+-----------+----------+
|Dairy Products|    1996-07|       304|
|     Beverages|    1996-08|       347|
|     Beverages|    1996-09|       285|
|Dairy Products|    1996-10|       367|
|Dairy Products|    1996-11|       372|
|Dairy Products|    1996-12|       653|
|   Confections|    1997-01|       623|
|   Confections|    1997-02|       425|
|     Beverages|    1997-03|       471|
|   Confections|    1997-04|       394|
|Dairy Products|    1997-05|       494|
|Dairy Products|    1997-06|       405|
|Dairy Products|    1997-07|       374|
|   Confections|    1997-08|       335|
|       Seafood|    1997-09|       630|
|     Beverages|    1997-10|       491|
|       Seafood|    1997-11|       414|
|     Beverages|    1997-12|       498|
|       Seafood|    1998-01|       735|
|     Beverages|    1998-02|       834|
+--------------+-----------+----------+
only showing top 20 rows

In [14]:
#ubah ke bentuk pandas untuk di upload ke BQ
df_datamart_category_sales=category_sales.toPandas()

In [15]:
# Create datamart tables  (supplier_revenue)


supplier_revenue = spark.sql("""

WITH supplier_revenue AS (
  SELECT
    s.COMPANYNAME AS company_name,
    DATE_FORMAT(DATE_TRUNC('month', o.ORDERDATE), 'yyyy-MM') AS month_order,
    SUM((od.UNITPRICE - (od.UNITPRICE * od.DISCOUNT)) * od.QUANTITY) AS gross_revenue
  FROM
    df_order_details od
    JOIN df_orders o ON od.ORDERID = o.ORDERID
    JOIN df_products p ON od.PRODUCTID = p.PRODUCTID
    JOIN df_suppliers s ON p.SUPPLIERID = s.SUPPLIERID
  GROUP BY
    company_name, month_order
)

SELECT
  company_name,
  month_order,
  gross_revenue
FROM
  supplier_revenue
ORDER BY
  company_name, month_order

""")

In [16]:
#cek bentuk data

supplier_revenue.show()

+--------------------+-----------+-----------------+
|        company_name|month_order|    gross_revenue|
+--------------------+-----------+-----------------+
|Aux joyeux ecclés...|    1996-07|            691.2|
|Aux joyeux ecclés...|    1996-09|           1252.8|
|Aux joyeux ecclés...|    1996-10|           4062.8|
|Aux joyeux ecclés...|    1996-11|         15857.04|
|Aux joyeux ecclés...|    1996-12|6568.800000000001|
|Aux joyeux ecclés...|    1997-01|         18803.36|
|Aux joyeux ecclés...|    1997-02|            374.4|
|Aux joyeux ecclés...|    1997-03|           6540.0|
|Aux joyeux ecclés...|    1997-04|           4132.5|
|Aux joyeux ecclés...|    1997-05|           8853.6|
|Aux joyeux ecclés...|    1997-06|            180.0|
|Aux joyeux ecclés...|    1997-07|         3844.875|
|Aux joyeux ecclés...|    1997-08|            643.5|
|Aux joyeux ecclés...|    1997-09|          3924.45|
|Aux joyeux ecclés...|    1997-12|           6377.1|
|Aux joyeux ecclés...|    1998-01|         19075.75|
|Aux joyeux ecclés...|    1998-02|          27859.9|
|Aux joyeux ecclés...|    1998-03|          17667.5|
|Aux joyeux ecclés...|    1998-04|           6587.5|
|Aux joyeux ecclés...|    1998-05|            394.2|
+--------------------+-----------+-----------------+
only showing top 20 rows

In [17]:
#ubah ke bentuk pandas untuk di upload ke BQ
df_datamart_supplier_revenue=supplier_revenue.toPandas()

In [18]:

from google.cloud import bigquery
import os
os.environ['GOOGLE_APPLICATION_CREDENTIALS'] = "./bridgtl-bgd-d-prj-bigdata-e3ffa0f77953.json"
client = bigquery.Client()

In [ ]:
# # Upload supplier_revenue to Bigquery
# # TABEL TUJUAN DI GCP
# table_id = "isi_nama_project.isi_nama_schema.supplier_revenue"

# client = bigquery.Client()

# job_config = bigquery.LoadJobConfig(
# source_format=bigquery.SourceFormat.CSV, autodetect=False,write_disposition = "WRITE_TRUNCATE") # bisa truncate bisa append

# job = client.load_table_from_dataframe(
# df_datamart_supplier_revenue, table_id, job_config=job_config)
# job.result()

In [ ]:
# Upload category_sales to Bigquery
# TABEL TUJUAN DI GCP
table_id = "isi_nama_project.isi_nama_schema.category_sales"

client = bigquery.Client()

job_config = bigquery.LoadJobConfig(
source_format=bigquery.SourceFormat.CSV, autodetect=False,write_disposition = "WRITE_TRUNCATE") # bisa truncate bisa append

job = client.load_table_from_dataframe(
df_datamart_category_sales, table_id, job_config=job_config)
job.result()

In [ ]:
# # Upload employee_revenues to Bigquery
# # TABEL TUJUAN DI GCP
# table_id = "isi_nama_project.isi_nama_schema.employee_revenues"

# client = bigquery.Client()

# job_config = bigquery.LoadJobConfig(
# source_format=bigquery.SourceFormat.CSV, autodetect=False,write_disposition = "WRITE_TRUNCATE") # bisa truncate bisa append

# job = client.load_table_from_dataframe(
# df_datamart_employee_revenues, table_id, job_config=job_config)
# job.result()